from blueprints.generate_plan.common import OutputParser, extract_meal_plan

data = {
    'menu': {
        'breakfast': {'糙米粥': {'糙米': 100}, '拌黄瓜': {'黄瓜': 150}},
        'lunch': {'红烧豆腐': {'豆腐': 200}, '清炒时蔬': {'青菜': 150, '胡萝卜': 50}},
        'dinner': {'红烧鲫鱼': {'鲫鱼': 200}, '蘑菇青菜炒糙米饭': {'糙米饭': 100, '蘑菇': 80, '青菜': 80}},
        'snack': {'煮玉米': {'玉米': 200}}
    },
    'options': {'糙米粥': {'糙米': 100}, '拌黄瓜': {'黄瓜': 150}, '红烧豆腐': {'豆腐': 200},
                '清炒时蔬': {'青菜': 150, '胡萝卜': 50}, '红烧鲫鱼': {'鲫鱼': 200},
                '蘑菇青菜炒糙米饭': {'糙米饭': 100, '蘑菇': 80, '青菜': 80}, '煮玉米': {'玉米': 200},
                '拌红豆': {'红豆': 100}, '炒白腰豆': {'白腰豆': 100}, '亚麻粉汤': {'亚麻粉': 50},
                '香蕉': {'香蕉': 100}, '土豆烧香菇': {'土豆': 100, '香菇': 50},
                '西芹炒核桃': {'西芹': 100, '核桃': 50}, '全麦面包片': {'全麦面包': 100}, '燕麦粥': {'燕麦': 100}}
}

new_data = {
    "menu": {
        "breakfast": {'糙米粥': {'糙米': 100}, '拌黄瓜': {'黄瓜': 150}},
        "lunch": {'红烧豆腐': {'豆腐': 200}, '清炒时蔬': {'青菜': 150, '胡萝卜': 50}},
        "dinner": {'红烧鲫鱼': {'鲫鱼': 200}, '蘑菇青菜炒糙米饭': {'糙米饭': 100, '蘑菇': 80, '青菜': 80}},
        "snack": {'煮玉米': {'玉米': 200}}
    },
    "options": {'拌红豆': {'红豆': 100}, '炒白腰豆': {'白腰豆': 100}, '亚麻粉汤': {'亚麻粉': 50}, '香蕉': {'香蕉': 100},
                '土豆烧香菇': {'土豆': 100, '香菇': 50}, '西芹炒核桃': {'西芹': 100, '核桃': 50},
                '全麦面包片': {'全麦面包': 100}, '燕麦粥': {'燕麦': 100}}
}
tmp = '```json\n{\n  \"health_report\": {\n    \"body_type\": \"obese\",\n    \"population_category\": \"adult\",\n    \"health_status\": \"血压偏高，血糖偏高，血尿酸偏高，总胆固醇正常，高密度脂蛋白胆固醇偏高，低密度脂蛋白胆固醇正常\",\n    \"risk_factors\": \"BMI显示肥胖，有高血压、高血糖和高尿酸血症的风险，饮食偏好猪肉和西湖醋鱼可能影响血脂和血尿酸水平，但无过敏史和既往病史\",\n    \"health_risks\": \"存在心血管疾病、糖尿病、痛风等疾病的风险\"\n  }\n}\n```'
print(OutputParser.extract_struct(tmp, dict))
d = OutputParser.extract_struct(tmp, dict)
print(d)
